app/controllers/ajax_controller.rb

SELECT DISTINCT "books"."publish" FROM "books"
---
  def search
    @books = Book.select(:publish).distinct

SELECT "books".* FROM "books" WHERE "books"."publish" = ?  [["publish", "技術評論社"]]
---
  def result
    sleep(2)
    @books = Book.where(publish: params[:publish])