app/controllers/books_controller.rb

SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @books = Book.all

INSERT INTO "books" ("isbn", "title", "publish", "published", "dl", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["isbn", "123"], ["title", ""], ["publish", ""], ["published", Fri, 17 Feb 2017], ["dl", false], ["created_at", 2017-02-17 06:39:40 UTC], ["updated_at", 2017-02-17 06:39:40 UTC]]
---
  def create

    #ハッシュ値を受け取る
    # render plain: params[:book].inspect
    # return


    # 個別のアクションでStrongParametersによるフィルター記述
    #@book = Book.new(params.require(:book).permit(:isbn, :title, :price, :publish, :published, :dl))

    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "published" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["published", Wed, 30 Sep 2020], ["updated_at", 2016-12-24 07:51:01 UTC], ["id", 1]]
---
  def update
    # sleep 3
    respond_to do |format|
      if @book.update(book_params)