app/controllers/ctrl_controller.rb

  def show_photo
    id = params[:id] ? params[:id] : 1
    @author = Author.find(id)
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]