app/controllers/extra_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def sendmail
    user = User.find(6)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_job
    user = User.find(6)

SELECT  "books".* FROM "books" ORDER BY published DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "books"
---
  def paging
    @books = Book.order('published DESC').
      paginate(page: params[:page], per_page: 5)