app/controllers/login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "yyamada"], ["LIMIT", 1]]
---
  def auth
    usr = User.find_by(username: params[:username])