app/controllers/members_controller.rb

  def index
    @members = Member.all
---
SELECT "members".* FROM "members"

  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("name", "email", "created_at", "updated_at", "lock_version") VALUES (?, ?, ?, ?, ?)  [["name", "山田太郎"], ["email", "yamada@wings.msn.to"], ["created_at", 2016-12-10 06:49:42 UTC], ["updated_at", 2016-12-10 06:49:42 UTC], ["lock_version", 0]]

    def set_member
      @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]