app/controllers/record_controller.rb

  def find
    @books = Book.find([2, 5, 10])
---
SELECT "books".* FROM "books" WHERE "books"."id" IN (2, 5, 10)

  def where2
    @books = Book.all
    @books.where!(publish: '技術評論社')
    @books.order!(:published)
---
SELECT "books".* FROM "books"
SELECT "books".* FROM "books" WHERE "books"."publish" = ? ORDER BY "books"."published" ASC  [["publish", "技術評論社"]]

  def enum_rec
    @review = Review.find(1)
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def assoc_join4
    @books = Book.left_outer_joins(:reviews).select('books.*, reviews.body')
---
SELECT books.*, reviews.body FROM "books" LEFT OUTER JOIN "reviews" ON "reviews"."book_id" = "books"."id"

  def attr
    @book = Book.find(1)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]