app/controllers/view_controller.rb

SELECT DISTINCT "books"."publish" FROM "books"
---
  def col_select
    @book = Book.new(publish: '技術評論社')
    @books = Book.select(:publish).distinct

SELECT "authors".* FROM "authors"
---
  def group_select
    @review = Review.new
    @authors = Author.all

SELECT "authors".* FROM "authors"
---
  def group_select2
    @review = Review.new
    @authors = Author.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def dat_select
    @book = Book.find(1)

SELECT DISTINCT "books"."publish" FROM "books"
---
  def col_radio
    @book = Book.new(publish: '技術評論社')
    @books = Book.select(:publish).distinct

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def fields
    @user = User.find(1)

SELECT "books".* FROM "books"
---
  def partial_col
    @books = Book.all